[
  {
    "id": "L2Q001",
    "stem": "A 55-year-old postmenopausal woman with ER+/HER2– stage I breast cancer completed lumpectomy. She has BMI 33 and is starting an aromatase inhibitor. She asks what single lifestyle change will most reduce her recurrence risk. What is the BEST initial counseling focus?",
    "choices": [
      "Adopt a structured program to achieve ≥150 minutes/week of moderate exercise with gradual weight loss target",
      "Eliminate all dietary fat and alcohol completely",
      "Begin high-dose vitamin D and calcium supplementation",
      "Start intermittent fasting with a goal of rapid 10% weight loss in 4 weeks"
    ],
    "answerIndex": 0,
    "rationale": "Sustained physical activity alongside gradual, durable weight loss improves metabolic health and is associated with reduced recurrence risk in postmenopausal HR+ survivors. Extreme dietary restriction or rapid weight loss is not evidence-based and may be unsafe; vitamin D/calcium are for bone health, not primary recurrence reduction.",
    "wrongAnswerNotes": {
      "Eliminate all dietary fat and alcohol completely": "All-or-nothing advice is rarely sustainable; modest alcohol reduction and balanced diet are reasonable, but exercise + gradual weight loss has the strongest evidence base.",
      "Begin high-dose vitamin D and calcium supplementation": "Useful for bone health on AI therapy, but not primary driver of recurrence risk reduction.",
      "Start intermittent fasting with a goal of rapid 10% weight loss in 4 weeks": "Rapid weight loss plans are unsafe and not recommended; durability matters more."
    },
    "domain": "Care Continuum",
    "tags": [
      "survivorship",
      "risk reduction",
      "exercise",
      "obesity",
      "aromatase inhibitor"
    ]
  },
  {
    "id": "L2Q002",
    "stem": "A 42-year-old woman with a strong paternal history of early-onset breast cancer and a maternal aunt with ovarian cancer asks about testing. Her own mammogram is normal. What is the MOST appropriate next step?",
    "choices": [
      "Refer for genetic counseling and consider multigene germline panel testing",
      "Order serum CA-125 level and pelvic ultrasound screening",
      "Advise annual mammography only because her imaging is normal",
      "Order a tumor genomic panel on the aunt’s archived tumor"
    ],
    "answerIndex": 0,
    "rationale": "Personal testing decisions should start with genetic counseling based on family history patterns suggestive of hereditary breast/ovarian cancer; a multigene panel is appropriate today. Screening CA-125/ultrasound lacks specificity; normal mammography does not address inherited risk; tumor-only testing in relatives is less informative than germline counseling.",
    "wrongAnswerNotes": {
      "Order serum CA-125 level and pelvic ultrasound screening": "Not recommended for unaffected women as primary risk assessment; low specificity.",
      "Advise annual mammography only because her imaging is normal": "Does not address possible hereditary risk.",
      "Order a tumor genomic panel on the aunt’s archived tumor": "Tumor profiling does not substitute for germline testing and counseling."
    },
    "domain": "Care Continuum",
    "tags": [
      "genetics",
      "HBOC",
      "family history",
      "risk assessment"
    ]
  },
  {
    "id": "L2Q003",
    "stem": "A 29-year-old lactating patient presents 2 weeks after delivery with erythema, warmth, and focal fluctuance in the left breast with fever. She worries about cancer. What is the BEST immediate management?",
    "choices": [
      "Ultrasound-guided aspiration for culture with initiation of antibiotics and continued breastfeeding",
      "Core needle biopsy of the fluctuance and stop breastfeeding",
      "Urgent MRI with contrast followed by broad-spectrum IV antibiotics",
      "Observation for 48 hours with NSAIDs and return if fever persists"
    ],
    "answerIndex": 0,
    "rationale": "Clinical picture suggests lactational abscess; ultrasound confirms and guides aspiration. Continue breastfeeding to facilitate drainage. Biopsy and MRI are not first-line; observation alone risks progression.",
    "wrongAnswerNotes": {
      "Core needle biopsy of the fluctuance and stop breastfeeding": "Biopsy is not first-line and stopping breastfeeding is unnecessary.",
      "Urgent MRI with contrast followed by broad-spectrum IV antibiotics": "MRI is not needed; start targeted management.",
      "Observation for 48 hours with NSAIDs and return if fever persists": "Potentially unsafe delay with abscess and fever."
    },
    "domain": "Care Continuum",
    "tags": [
      "lactation",
      "abscess",
      "ultrasound",
      "infection",
      "care continuum"
    ]
  },
  {
    "id": "L2Q004",
    "stem": "A 38-year-old premenopausal woman with LCIS on core biopsy seeks risk reduction. She has no contraindications to medications and prefers nonsurgical strategies. What is the MOST appropriate recommendation?",
    "choices": [
      "Tamoxifen chemoprevention with annual breast MRI plus mammography",
      "Bilateral prophylactic mastectomy because LCIS is an obligate precursor",
      "Aromatase inhibitor therapy for 5 years",
      "No additional screening beyond annual mammography"
    ],
    "answerIndex": 0,
    "rationale": "Classic LCIS is a risk indicator; tamoxifen reduces future ER+ cancer risk in premenopausal women. Enhanced screening with MRI may be appropriate depending on overall risk. LCIS is not an obligate precursor; AIs are for postmenopausal prevention; mammography alone underestimates risk management needs.",
    "wrongAnswerNotes": {
      "Bilateral prophylactic mastectomy because LCIS is an obligate precursor": "LCIS is not obligate; surgery reserved for select scenarios.",
      "Aromatase inhibitor therapy for 5 years": "AIs are prevention options for postmenopausal women, not premenopausal.",
      "No additional screening beyond annual mammography": "High-risk status often warrants MRI in addition to mammogram."
    },
    "domain": "Care Continuum",
    "tags": [
      "LCIS",
      "chemoprevention",
      "tamoxifen",
      "high-risk screening",
      "MRI"
    ]
  },
  {
    "id": "L2Q005",
    "stem": "A 61-year-old postmenopausal long-term survivor after left-sided whole breast irradiation and anthracycline exposure reports new exertional dyspnea without chest pain. Vitals are normal. What is the nurse’s PRIORITY action?",
    "choices": [
      "Notify the provider to evaluate for cardiotoxicity and arrange cardiac assessment",
      "Reassure the patient and schedule a routine follow-up visit in 3 months",
      "Advise to reduce exercise intensity and monitor at home",
      "Order a chest radiograph to assess for rib fracture from prior radiation"
    ],
    "answerIndex": 0,
    "rationale": "Left-sided radiation and anthracyclines increase cardiotoxicity risk. New exertional dyspnea warrants prompt evaluation (e.g., ECG/echo), not reassurance or delayed follow-up.",
    "wrongAnswerNotes": {
      "Reassure the patient and schedule a routine follow-up visit in 3 months": "Delays evaluation of a potential late cardiac effect.",
      "Advise to reduce exercise intensity and monitor at home": "Symptom warrants diagnostic assessment first.",
      "Order a chest radiograph to assess for rib fracture from prior radiation": "Less likely given isolated exertional dyspnea."
    },
    "domain": "Care Continuum",
    "tags": [
      "survivorship",
      "cardiotoxicity",
      "late effects",
      "radiation",
      "anthracycline"
    ]
  },
  {
    "id": "L2Q006",
    "stem": "A 47-year-old woman with heterogeneous dense breasts and no family history asks about supplemental screening after a normal mammogram. What is the most appropriate counseling?",
    "choices": [
      "Discuss benefits and limitations of adjunct screening (e.g., ultrasound) based on density-related masking risk",
      "Order annual breast MRI for all patients with dense breasts",
      "No additional imaging is appropriate in any patient with dense breasts",
      "Order contrast-enhanced mammography and discontinue routine mammography"
    ],
    "answerIndex": 0,
    "rationale": "Breast density raises masking risk; shared decision-making regarding adjunct screening (e.g., ultrasound) is reasonable. MRI is reserved for higher-risk groups; density alone does not mandate MRI; CEM does not replace mammography.",
    "wrongAnswerNotes": {
      "Order annual breast MRI for all patients with dense breasts": "MRI is not recommended solely for density without additional high-risk features.",
      "No additional imaging is appropriate in any patient with dense breasts": "Adjunct screening may be appropriate in some.",
      "Order contrast-enhanced mammography and discontinue routine mammography": "CEM is adjunctive; mammography continues."
    },
    "domain": "Care Continuum",
    "tags": [
      "breast density",
      "screening",
      "shared decision-making",
      "ultrasound"
    ]
  },
  {
    "id": "L2Q007",
    "stem": "A 35-year-old patient with a BRCA1 mutation is planning pregnancy in the next year. She asks about timing of risk-reducing salpingo-oophorectomy (RRSO). What is the BEST counseling?",
    "choices": [
      "RRSO is generally recommended by age 35–40 for BRCA1 after childbearing; coordinate with fertility plans",
      "RRSO should be done immediately regardless of fertility plans",
      "RRSO is unnecessary if she has annual pelvic ultrasound and CA-125 testing",
      "Delay RRSO until natural menopause to avoid premature menopause"
    ],
    "answerIndex": 0,
    "rationale": "For BRCA1, RRSO by 35–40 after completing childbearing is standard due to ovarian cancer risk. Screening with CA-125/ultrasound is not a substitute; delaying until natural menopause increases risk.",
    "wrongAnswerNotes": {
      "RRSO should be done immediately regardless of fertility plans": "Fertility planning and timing are important; immediate surgery may not be required if pregnancy is imminent.",
      "RRSO is unnecessary if she has annual pelvic ultrasound and CA-125 testing": "Screening is not adequate prevention.",
      "Delay RRSO until natural menopause to avoid premature menopause": "Defers risk-reduction beyond recommended timing."
    },
    "domain": "Care Continuum",
    "tags": [
      "BRCA1",
      "RRSO",
      "fertility",
      "risk reduction"
    ]
  },
  {
    "id": "L2Q008",
    "stem": "A 58-year-old survivor on an aromatase inhibitor has a T-score of −2.6 at the femoral neck and no fractures. What is the BEST next step to reduce fracture risk and support survivorship?",
    "choices": [
      "Initiate antiresorptive therapy (e.g., zoledronic acid or denosumab) with calcium/vitamin D and exercise",
      "Stop endocrine therapy and switch to tamoxifen",
      "Increase dietary calcium only",
      "Observation with repeat DEXA in 2 years"
    ],
    "answerIndex": 0,
    "rationale": "Osteoporosis (T-score ≤ −2.5) on AI warrants antiresorptive therapy plus calcium/vitamin D and weight-bearing exercise. Switching endocrine therapy is not first-line solely for bone density.",
    "wrongAnswerNotes": {
      "Stop endocrine therapy and switch to tamoxifen": "Consider only for refractory intolerance; bone agents are standard first step.",
      "Increase dietary calcium only": "Insufficient alone for osteoporosis.",
      "Observation with repeat DEXA in 2 years": "Misses opportunity to reduce fracture risk."
    },
    "domain": "Care Continuum",
    "tags": [
      "survivorship",
      "bone health",
      "AIs",
      "DEXA",
      "bisphosphonate",
      "denosumab"
    ]
  },
  {
    "id": "L2Q009",
    "stem": "A 44-year-old African American woman with limited transportation and childcare barriers missed two diagnostic appointments for suspicious calcifications. What is the nurse navigator’s MOST effective first action?",
    "choices": [
      "Contact the patient to identify barriers and coordinate same-day imaging with transportation support",
      "Mail educational brochures about breast cancer and imaging importance",
      "Document non-adherence and ask the PCP to reschedule",
      "Wait for the patient to call when ready to proceed"
    ],
    "answerIndex": 0,
    "rationale": "Navigation addresses barriers to care through direct outreach, problem solving, and coordination (transport, childcare, same-day services). Passive education or deferring action risks delay.",
    "wrongAnswerNotes": {
      "Mail educational brochures about breast cancer and imaging importance": "Passive and unlikely to overcome concrete barriers.",
      "Document non-adherence and ask the PCP to reschedule": "Does not address underlying barriers.",
      "Wait for the patient to call when ready to proceed": "Prolongs delay."
    },
    "domain": "Care Continuum",
    "tags": [
      "navigation",
      "barriers to care",
      "health disparities",
      "access"
    ]
  },
  {
    "id": "L2Q010",
    "stem": "A 50-year-old woman with a Tyrer–Cuzick lifetime risk of 24% asks about screening. What is the BEST recommendation?",
    "choices": [
      "Annual mammography plus annual breast MRI",
      "Annual mammography only",
      "Breast MRI every 2 years only",
      "Stop screening at age 50 and restart at 60"
    ],
    "answerIndex": 0,
    "rationale": "≥20% lifetime risk qualifies for annual MRI in addition to mammography.",
    "wrongAnswerNotes": {
      "Annual mammography only": "Underestimates risk-based screening needs.",
      "Breast MRI every 2 years only": "MRI complements, not replaces, mammography.",
      "Stop screening at age 50 and restart at 60": "Not evidence-based."
    },
    "domain": "Care Continuum",
    "tags": [
      "high risk",
      "Tyrer–Cuzick",
      "MRI",
      "screening"
    ]
  },
  {
    "id": "L2Q011",
    "stem": "A 63-year-old patient completed curative therapy 2 years ago and asks about survivorship care. Which plan is MOST appropriate?",
    "choices": [
      "Risk-appropriate breast imaging, symptom-directed workup, management of late effects, and health promotion (exercise, weight, vaccines)",
      "Annual PET/CT scans to detect early recurrence in asymptomatic patients",
      "Routine tumor markers every 3 months",
      "No further follow-up needed"
    ],
    "answerIndex": 0,
    "rationale": "Survivorship care focuses on surveillance imaging per guidelines, symptom-driven evaluation, late-effect management, and health promotion. Routine PET/CT and tumor markers are not recommended in asymptomatic survivors.",
    "wrongAnswerNotes": {
      "Annual PET/CT scans to detect early recurrence in asymptomatic patients": "Not recommended; no survival benefit, high false positives.",
      "Routine tumor markers every 3 months": "Not recommended for routine follow-up.",
      "No further follow-up needed": "Survivorship follow-up is recommended."
    },
    "domain": "Care Continuum",
    "tags": [
      "survivorship",
      "surveillance",
      "health promotion"
    ]
  },
  {
    "id": "L2Q012",
    "stem": "A 48-year-old with ER+/HER2– invasive cancer and a sister with male breast cancer asks about her children’s risk. Which is the BEST initial step?",
    "choices": [
      "Refer the patient for genetic counseling and germline testing before testing children",
      "Test the children first to expedite risk assessment",
      "Order tumor genomic profiling to guide hereditary risk",
      "No testing is needed because her disease is not triple negative"
    ],
    "answerIndex": 0,
    "rationale": "Testing the affected adult first is the most informative; tumor-only profiling does not assess germline risk; subtype alone does not rule out hereditary syndromes.",
    "wrongAnswerNotes": {
      "Test the children first to expedite risk assessment": "Less informative; negative results would be uninterpretable without knowing the familial variant.",
      "Order tumor genomic profiling to guide hereditary risk": "Tumor profiling ≠ germline testing.",
      "No testing is needed because her disease is not triple negative": "Family history (male breast cancer) raises suspicion regardless of subtype."
    },
    "domain": "Care Continuum",
    "tags": [
      "genetics",
      "counseling",
      "family history",
      "male breast cancer"
    ]
  },
  {
    "id": "L2Q013",
    "stem": "A 69-year-old long-term aromatase inhibitor user with well-controlled hypertension asks about alcohol at a wedding. What is the BEST advice aligned with survivorship and cardiovascular risk reduction?",
    "choices": [
      "Limit to no more than one standard drink and prioritize hydration; avoid routine alcohol intake",
      "Alcohol has no effect on breast cancer or cardiovascular risk",
      "Any amount of alcohol is contraindicated in breast cancer survivors",
      "Switch to tamoxifen so that alcohol is safer"
    ],
    "answerIndex": 0,
    "rationale": "Moderation is key; limiting alcohol supports breast and cardiovascular health. Absolute prohibition is not required, but routine use should be minimized.",
    "wrongAnswerNotes": {
      "Alcohol has no effect on breast cancer or cardiovascular risk": "Not accurate; alcohol is associated with risk.",
      "Any amount of alcohol is contraindicated in breast cancer survivors": "Overly restrictive; moderation guidance is appropriate.",
      "Switch to tamoxifen so that alcohol is safer": "Therapy choice should not be driven by an isolated social event."
    },
    "domain": "Care Continuum",
    "tags": [
      "survivorship",
      "alcohol",
      "counseling",
      "cardiometabolic risk"
    ]
  },
  {
    "id": "L2Q014",
    "stem": "A 31-year-old with a new palpable mass presents for evaluation. Which initial imaging strategy is BEST?",
    "choices": [
      "Targeted breast ultrasound of the palpable area",
      "Screening mammography",
      "MRI with contrast as first test",
      "PET/CT to evaluate for metastasis"
    ],
    "answerIndex": 0,
    "rationale": "For women under ~30–35 with a focal mass, targeted ultrasound is preferred first-line. Mammography or MRI may follow based on findings.",
    "wrongAnswerNotes": {
      "Screening mammography": "Screening is not the initial test for a symptomatic mass in this age group.",
      "MRI with contrast as first test": "Not first-line given age and presentation.",
      "PET/CT to evaluate for metastasis": "Not appropriate for initial workup."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "palpable mass",
      "ultrasound",
      "imaging"
    ]
  },
  {
    "id": "L2Q015",
    "stem": "A diagnostic mammogram shows new pleomorphic calcifications in segmental distribution in the upper-outer quadrant. What is the MOST appropriate biopsy approach?",
    "choices": [
      "Stereotactic core needle biopsy targeting the calcifications",
      "Fine-needle aspiration of the calcifications",
      "Excisional biopsy in the operating room without image guidance",
      "Ultrasound-guided core biopsy regardless of sonographic visibility"
    ],
    "answerIndex": 0,
    "rationale": "Stereotactic core biopsy is standard for sampling mammographic calcifications; FNA is inadequate; ultrasound guidance is used only if the target is sonographically visible.",
    "wrongAnswerNotes": {
      "Fine-needle aspiration of the calcifications": "Often insufficient for calcifications.",
      "Excisional biopsy in the operating room without image guidance": "Overtreatment as initial step.",
      "Ultrasound-guided core biopsy regardless of sonographic visibility": "Ultrasound requires visible target."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "calcifications",
      "stereotactic biopsy",
      "diagnostic imaging"
    ]
  },
  {
    "id": "L2Q016",
    "stem": "A 52-year-old with a 6.2 cm mass fixed to the chest wall and peau d’orange presents for staging. Which T or overall clinical descriptor BEST applies?",
    "choices": [
      "T4 disease",
      "T3 disease",
      "Inflammatory changes are not part of T staging",
      "M1 disease"
    ],
    "answerIndex": 0,
    "rationale": "Fixation to chest wall and skin changes indicate T4 features; M1 is distant metastasis and requires evidence of distant spread.",
    "wrongAnswerNotes": {
      "T3 disease": "T3 relates to size >5 cm without chest wall/skin involvement.",
      "Inflammatory changes are not part of T staging": "Skin involvement/inflammatory features are T4 descriptors.",
      "M1 disease": "No distant metastasis described."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "staging",
      "TNM",
      "T4",
      "skin involvement"
    ]
  },
  {
    "id": "L2Q017",
    "stem": "Core biopsy shows ER 90%, PR 0%, HER2 IHC 2+ with FISH negative, Ki-67 28%. What is the MOST accurate receptor interpretation?",
    "choices": [
      "ER positive, PR negative, HER2 negative (HR+ / HER2–)",
      "Triple negative",
      "HER2 positive by IHC 2+",
      "Equivocal HER2 status requiring repeat FISH due to Ki-67 elevation"
    ],
    "answerIndex": 0,
    "rationale": "HER2 IHC 2+ requires confirmatory ISH; negative FISH defines HER2 negative. ER positive and PR negative indicates HR+ disease.",
    "wrongAnswerNotes": {
      "Triple negative": "ER+ excludes triple negative.",
      "HER2 positive by IHC 2+": "IHC 2+ is equivocal; negative FISH = HER2–.",
      "Equivocal HER2 status requiring repeat FISH due to Ki-67 elevation": "Ki-67 does not determine HER2 status."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "ER/PR/HER2",
      "Ki-67",
      "pathology"
    ]
  },
  {
    "id": "L2Q018",
    "stem": "A 47-year-old with a newly diagnosed cT2N0 ER+/HER2– invasive ductal carcinoma asks about additional staging imaging. She has no symptoms. What is the BEST recommendation?",
    "choices": [
      "No routine systemic staging imaging is indicated in asymptomatic early-stage patients",
      "Order PET/CT to rule out occult metastases",
      "Order bone scan and CT chest/abdomen for all new breast cancers",
      "Order tumor markers to screen for metastasis"
    ],
    "answerIndex": 0,
    "rationale": "Routine systemic staging imaging is not recommended in asymptomatic early-stage breast cancer due to low yield and false positives.",
    "wrongAnswerNotes": {
      "Order PET/CT to rule out occult metastases": "Overuse; not recommended without symptoms/high stage.",
      "Order bone scan and CT chest/abdomen for all new breast cancers": "Not indicated in asymptomatic, early-stage patients.",
      "Order tumor markers to screen for metastasis": "Not recommended for staging."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "staging imaging",
      "asymptomatic",
      "early stage"
    ]
  },
  {
    "id": "L2Q019",
    "stem": "A 58-year-old presents with a bloody, unilateral single-duct nipple discharge. Physical exam is otherwise normal. What is the BEST initial diagnostic approach?",
    "choices": [
      "Diagnostic mammography and targeted ultrasound of the subareolar region",
      "Empiric antibiotics and observation",
      "Immediate MRI only",
      "Serum prolactin and thyroid-stimulating hormone testing"
    ],
    "answerIndex": 0,
    "rationale": "Pathologic discharge (bloody, unilateral, single-duct) warrants diagnostic mammogram and targeted ultrasound to evaluate for intraductal lesion; MRI may follow if negative/inconclusive.",
    "wrongAnswerNotes": {
      "Empiric antibiotics and observation": "Inappropriate for pathologic discharge without infection signs.",
      "Immediate MRI only": "Mammography/ultrasound are first-line.",
      "Serum prolactin and thyroid-stimulating hormone testing": "For galactorrhea evaluation, not pathologic discharge."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "nipple discharge",
      "diagnostic mammography",
      "ultrasound"
    ]
  },
  {
    "id": "L2Q020",
    "stem": "A patient’s pathology shows extensive lymphovascular invasion (LVI) but negative nodes. Which statement is MOST accurate?",
    "choices": [
      "LVI is an adverse prognostic feature and may influence adjuvant therapy decisions",
      "LVI reclassifies the tumor as node positive",
      "LVI eliminates the need for genomic assays",
      "LVI alone mandates postmastectomy radiation"
    ],
    "answerIndex": 0,
    "rationale": "LVI is adverse prognostically but does not equal nodal disease; it can inform risk discussions but is not a sole mandate for PMRT or exclusion of genomic assays.",
    "wrongAnswerNotes": {
      "LVI reclassifies the tumor as node positive": "Incorrect; node status is separate.",
      "LVI eliminates the need for genomic assays": "Not true; assays may still be informative.",
      "LVI alone mandates postmastectomy radiation": "PMRT decisions are multifactorial; LVI alone is insufficient."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "pathology",
      "LVI",
      "prognosis"
    ]
  },
  {
    "id": "L2Q021",
    "stem": "A patient with a 1.1 cm grade 2, node-negative tumor undergoes lumpectomy with 'no ink on tumor' margins. DCIS is ≥2 mm from the margin. What is the BEST margin interpretation for invasive disease?",
    "choices": [
      "No ink on tumor is adequate; no re-excision needed",
      "A minimum 2 mm margin is required for invasive disease",
      "Re-excision is needed because DCIS is present",
      "Re-excision is needed due to tumor size >1 cm"
    ],
    "answerIndex": 0,
    "rationale": "'No ink on tumor' is adequate for invasive cancer; ≥2 mm margin applies to pure DCIS.",
    "wrongAnswerNotes": {
      "A minimum 2 mm margin is required for invasive disease": "This threshold is for DCIS.",
      "Re-excision is needed because DCIS is present": "Not if margins for invasive cancer are negative and DCIS is clear.",
      "Re-excision is needed due to tumor size >1 cm": "Size does not change margin adequacy."
    },
    "domain": "Diagnosis & Staging",
    "tags": [
      "margins",
      "lumpectomy",
      "DCIS vs invasive"
    ]
  },
  {
    "id": "L2Q022",
    "stem": "A 52-year-old with cT2N1 HER2+ disease receives neoadjuvant taxane + trastuzumab/pertuzumab. At surgery, residual invasive disease is present. What is the MOST appropriate adjuvant systemic therapy?",
    "choices": [
      "Ado-trastuzumab emtansine for 14 cycles",
      "Complete trastuzumab alone to 1 year",
      "Pertuzumab monotherapy for 1 year",
      "No further therapy is needed after surgery"
    ],
    "answerIndex": 0,
    "rationale": "Residual disease after neoadjuvant HER2 therapy warrants escalation to T-DM1 for 14 cycles based on improved outcomes versus continuing trastuzumab alone.",
    "wrongAnswerNotes": {
      "Complete trastuzumab alone to 1 year": "Appropriate after pCR; inferior with residual disease.",
      "Pertuzumab monotherapy for 1 year": "Not standard as single agent adjuvantly.",
      "No further therapy is needed after surgery": "Undertreatment."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "HER2+",
      "neoadjuvant",
      "T-DM1",
      "adjuvant"
    ]
  },
  {
    "id": "L2Q023",
    "stem": "A 45-year-old with node-negative TNBC measuring 1.3 cm after lumpectomy asks about chemotherapy. What is the BEST recommendation?",
    "choices": [
      "Adjuvant chemotherapy is recommended for T1c TNBC",
      "No chemotherapy is needed for tumors <2 cm",
      "Endocrine therapy alone is appropriate",
      "Anti-HER2 therapy is indicated"
    ],
    "answerIndex": 0,
    "rationale": "For TNBC ≥1 cm, adjuvant chemotherapy is recommended due to higher systemic risk; endocrine and anti-HER2 therapies are not applicable.",
    "wrongAnswerNotes": {
      "No chemotherapy is needed for tumors <2 cm": "Incorrect for TNBC ≥1 cm.",
      "Endocrine therapy alone is appropriate": "TNBC lacks hormone receptors.",
      "Anti-HER2 therapy is indicated": "TNBC is HER2 negative."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "TNBC",
      "adjuvant chemotherapy"
    ]
  },
  {
    "id": "L2Q024",
    "stem": "A 63-year-old postmenopausal patient with ER+/HER2–, node-negative cancer has an Oncotype DX score of 26. What is the BEST systemic therapy plan?",
    "choices": [
      "Adjuvant chemotherapy followed by endocrine therapy",
      "Endocrine therapy alone",
      "CDK4/6 inhibitor with endocrine therapy in the adjuvant setting for low-risk disease",
      "Observation only"
    ],
    "answerIndex": 0,
    "rationale": "For postmenopausal node-negative HR+ patients, RS ≥26 supports a chemotherapy benefit followed by endocrine therapy.",
    "wrongAnswerNotes": {
      "Endocrine therapy alone": "Appropriate for lower RS; here RS suggests chemo benefit.",
      "CDK4/6 inhibitor with endocrine therapy in the adjuvant setting for low-risk disease": "Reserved for higher-risk settings and not standard for RS-driven low-risk.",
      "Observation only": "Endocrine therapy is indicated."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "Oncotype DX",
      "ER+",
      "adjuvant chemotherapy",
      "endocrine therapy"
    ]
  },
  {
    "id": "L2Q025",
    "stem": "A 39-year-old premenopausal patient with ER+/PR+ node-positive disease completed chemotherapy. What adjuvant endocrine strategy is MOST appropriate?",
    "choices": [
      "Ovarian function suppression plus an aromatase inhibitor",
      "Tamoxifen alone for 5 years",
      "Fulvestrant monotherapy for 5 years",
      "No endocrine therapy needed after chemotherapy"
    ],
    "answerIndex": 0,
    "rationale": "In higher-risk premenopausal patients (e.g., node-positive), OFS plus AI improves outcomes compared with tamoxifen alone.",
    "wrongAnswerNotes": {
      "Tamoxifen alone for 5 years": "An option, but OFS+AI provides superior risk reduction in higher-risk premenopausal patients.",
      "Fulvestrant monotherapy for 5 years": "Not standard in adjuvant setting.",
      "No endocrine therapy needed after chemotherapy": "Endocrine therapy remains essential."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "premenopausal",
      "OFS",
      "aromatase inhibitor",
      "endocrine therapy"
    ]
  },
  {
    "id": "L2Q026",
    "stem": "A 55-year-old with cT2N0 ER+/HER2– disease is planned for neoadjuvant therapy to increase breast conservation. Which regimen is MOST appropriate?",
    "choices": [
      "Neoadjuvant endocrine therapy (e.g., aromatase inhibitor) if strongly ER+",
      "Neoadjuvant platinum-based chemotherapy",
      "Neoadjuvant trastuzumab-based therapy",
      "Neoadjuvant capecitabine monotherapy"
    ],
    "answerIndex": 0,
    "rationale": "For postmenopausal/ER-strongly positive tumors, neoadjuvant endocrine therapy can downstage to facilitate BCS. Platinum is for TNBC; anti-HER2 for HER2+; capecitabine monotherapy is not standard neoadjuvantly.",
    "wrongAnswerNotes": {
      "Neoadjuvant platinum-based chemotherapy": "Primarily for TNBC.",
      "Neoadjuvant trastuzumab-based therapy": "Used for HER2+, not HER2–.",
      "Neoadjuvant capecitabine monotherapy": "Not standard for neoadjuvant downstaging."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "neoadjuvant endocrine therapy",
      "ER+",
      "breast conservation"
    ]
  },
  {
    "id": "L2Q027",
    "stem": "A 58-year-old with T3N1 disease undergoing mastectomy asks about radiation. Which statement is MOST accurate?",
    "choices": [
      "Postmastectomy radiation is recommended due to nodal involvement and tumor size",
      "Radiation is unnecessary after any mastectomy",
      "Radiation is only for positive margins",
      "Radiation should be avoided if the patient is over age 55"
    ],
    "answerIndex": 0,
    "rationale": "PMRT is recommended for node-positive and/or larger tumors to reduce locoregional recurrence and improve outcomes.",
    "wrongAnswerNotes": {
      "Radiation is unnecessary after any mastectomy": "Not correct; PMRT is risk-based.",
      "Radiation is only for positive margins": "Margins are one factor; nodes/size also matter.",
      "Radiation should be avoided if the patient is over age 55": "Age is not a contraindication."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "PMRT",
      "node positive",
      "T3"
    ]
  },
  {
    "id": "L2Q028",
    "stem": "A 46-year-old with HER2+ stage II breast cancer receives neoadjuvant chemotherapy and has a pathologic complete response (pCR). What is the BEST anti-HER2 adjuvant plan?",
    "choices": [
      "Complete trastuzumab to a total of 1 year of anti-HER2 therapy",
      "Escalate to T-DM1 for 14 cycles",
      "Stop all anti-HER2 therapy after surgery due to pCR",
      "Switch to neratinib immediately after surgery"
    ],
    "answerIndex": 0,
    "rationale": "After pCR, standard is to complete trastuzumab to 1 year; escalation to T‑DM1 is reserved for residual disease.",
    "wrongAnswerNotes": {
      "Escalate to T-DM1 for 14 cycles": "Indicated for residual disease, not pCR.",
      "Stop all anti-HER2 therapy after surgery due to pCR": "Continue to complete 1 year.",
      "Switch to neratinib immediately after surgery": "Considered in some high-risk HR+/HER2+ cases after trastuzumab-based therapy completion, not routine immediately post-op."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "HER2+",
      "pCR",
      "trastuzumab",
      "adjuvant"
    ]
  },
  {
    "id": "L2Q029",
    "stem": "A patient desires immediate implant-based reconstruction after mastectomy but will likely need PMRT. What preoperative counseling is MOST accurate?",
    "choices": [
      "Radiation increases risks of capsular contracture and reconstruction complications; discuss staged or autologous options",
      "Radiation has no effect on implants placed immediately",
      "Autologous reconstruction is contraindicated if radiation is planned",
      "Immediate implant placement guarantees the best cosmetic outcome with PMRT"
    ],
    "answerIndex": 0,
    "rationale": "PMRT increases implant-related complications; staged or autologous reconstruction may provide better outcomes; shared decision-making is essential.",
    "wrongAnswerNotes": {
      "Radiation has no effect on implants placed immediately": "Incorrect; PMRT increases complications.",
      "Autologous reconstruction is contraindicated if radiation is planned": "Not true; often preferred post-PMRT.",
      "Immediate implant placement guarantees the best cosmetic outcome with PMRT": "Often worse cosmesis with PMRT."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "reconstruction",
      "PMRT",
      "shared decision-making"
    ]
  },
  {
    "id": "L2Q030",
    "stem": "A 67-year-old with HR+/HER2– metastatic breast cancer starts AI + CDK4/6 inhibitor and develops grade 3 neutropenia without fever. What is the BEST management?",
    "choices": [
      "Hold the CDK4/6 inhibitor and resume at reduced dose per label; continue AI",
      "Stop both drugs permanently",
      "Begin prophylactic long-term antibiotics",
      "Switch immediately to cytotoxic chemotherapy"
    ],
    "answerIndex": 0,
    "rationale": "CDK4/6 inhibitor neutropenia is managed with dose holds/reductions; febrile risk is lower than with cytotoxics. Continue endocrine partner.",
    "wrongAnswerNotes": {
      "Stop both drugs permanently": "Unnecessary; adjust dose first.",
      "Begin prophylactic long-term antibiotics": "Not indicated.",
      "Switch immediately to cytotoxic chemotherapy": "Not required for manageable toxicity."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "metastatic HR+",
      "CDK4/6",
      "neutropenia",
      "dose modification"
    ]
  },
  {
    "id": "L2Q031",
    "stem": "A 54-year-old with ER+/HER2– metastatic disease has progression on AI + CDK4/6 inhibitor. PIK3CA mutation is detected. Best next targeted option?",
    "choices": [
      "Alpelisib with endocrine therapy if tolerable",
      "Continue same regimen and add denosumab",
      "Switch to trastuzumab-based therapy",
      "Initiate pembrolizumab with platinum"
    ],
    "answerIndex": 0,
    "rationale": "For HR+/HER2– MBC with PIK3CA mutation, alpelisib plus endocrine therapy is an approved option. Other choices address different subtypes or indications.",
    "wrongAnswerNotes": {
      "Continue same regimen and add denosumab": "Denosumab treats bone loss; not disease progression.",
      "Switch to trastuzumab-based therapy": "For HER2+ disease.",
      "Initiate pembrolizumab with platinum": "For TNBC, not HR+/HER2–."
    },
    "domain": "Treatment Modalities",
    "tags": [
      "metastatic HR+",
      "PIK3CA",
      "alpelisib",
      "targeted therapy"
    ]
  },
  {
    "id": "L2Q032",
    "stem": "A patient receiving paclitaxel reports numbness in the toes interfering with sleep and buttons. What is the nurse’s BEST first action?",
    "choices": [
      "Notify provider to consider dose hold/reduction and initiate neuropathy symptom management",
      "Reassure that neuropathy is temporary and continue current dosing",
      "Start long-term corticosteroids to reduce inflammation",
      "Stop all chemotherapy permanently"
    ],
    "answerIndex": 0,
    "rationale": "Taxane neuropathy is managed with dose modifications and symptomatic measures; reassurance alone is insufficient; chronic steroids are not indicated; permanent discontinuation is reserved for severe refractory cases.",
    "wrongAnswerNotes": {
      "Reassure that neuropathy is temporary and continue current dosing": "May worsen disability.",
      "Start long-term corticosteroids to reduce inflammation": "Not standard for CIPN.",
      "Stop all chemotherapy permanently": "Too aggressive initially."
    },
    "domain": "Nursing Practice",
    "tags": [
      "neuropathy",
      "taxane",
      "symptom management",
      "dose modification"
    ]
  },
  {
    "id": "L2Q033",
    "stem": "Six days after AC chemotherapy, a patient calls with fever 38.8°C (101.8°F), chills, and ANC 400/mm³. What is the nurse’s PRIORITY instruction?",
    "choices": [
      "Proceed immediately to the emergency department for evaluation and IV antibiotics",
      "Take oral antibiotics at home and call in 48 hours",
      "Increase fluids and rest; come tomorrow if fever persists",
      "Check another CBC at a local lab before deciding"
    ],
    "answerIndex": 0,
    "rationale": "Febrile neutropenia is an oncologic emergency requiring prompt in-person evaluation and IV empiric antibiotics.",
    "wrongAnswerNotes": {
      "Take oral antibiotics at home and call in 48 hours": "Unsafe delay.",
      "Increase fluids and rest; come tomorrow if fever persists": "Delays critical care.",
      "Check another CBC at a local lab before deciding": "Do not delay treatment for repeat labs."
    },
    "domain": "Nursing Practice",
    "tags": [
      "febrile neutropenia",
      "oncologic emergency",
      "AC"
    ]
  },
  {
    "id": "L2Q034",
    "stem": "During paclitaxel infusion, the patient develops flushing, chest tightness, and dyspnea. What is the nurse’s FIRST action?",
    "choices": [
      "Stop the infusion and assess vital signs; notify provider",
      "Give oral diphenhydramine and continue infusion at slower rate",
      "Switch to docetaxel immediately",
      "Reassure and continue infusion as symptoms usually resolve"
    ],
    "answerIndex": 0,
    "rationale": "Signs of hypersensitivity require immediate stop, assessment, and provider notification; premedication or rate changes alone are inappropriate during acute reaction.",
    "wrongAnswerNotes": {
      "Give oral diphenhydramine and continue infusion at slower rate": "Do not continue during reaction.",
      "Switch to docetaxel immediately": "Not the first response and cross-reactivity exists.",
      "Reassure and continue infusion as symptoms usually resolve": "Unsafe."
    },
    "domain": "Nursing Practice",
    "tags": [
      "hypersensitivity",
      "taxane",
      "infusion reaction"
    ]
  },
  {
    "id": "L2Q035",
    "stem": "A patient on tamoxifen reports new unilateral calf pain and swelling. What is the nurse’s PRIORITY action?",
    "choices": [
      "Send urgently for evaluation for deep vein thrombosis",
      "Advise leg elevation and warm compresses at home",
      "Schedule an ultrasound next week",
      "Switch immediately to an aromatase inhibitor"
    ],
    "answerIndex": 0,
    "rationale": "Tamoxifen increases VTE risk; suspicious symptoms warrant urgent evaluation. Home care or delayed imaging is inappropriate.",
    "wrongAnswerNotes": {
      "Advise leg elevation and warm compresses at home": "Delays care for possible DVT.",
      "Schedule an ultrasound next week": "Evaluation should be urgent.",
      "Switch immediately to an aromatase inhibitor": "Management of suspected DVT comes first."
    },
    "domain": "Nursing Practice",
    "tags": [
      "tamoxifen",
      "VTE",
      "triage"
    ]
  },
  {
    "id": "L2Q036",
    "stem": "A patient on trastuzumab develops new dyspnea and LVEF drop from 60% to 45% on echo without symptoms at rest. What is the BEST nursing action?",
    "choices": [
      "Hold trastuzumab and notify the provider; arrange cardiology evaluation",
      "Continue therapy and recheck echo in 6 months",
      "Start high-dose steroids for pneumonitis",
      "Discontinue all systemic therapy permanently"
    ],
    "answerIndex": 0,
    "rationale": "Trastuzumab-related cardiomyopathy requires drug hold and cardiac evaluation; continuing without assessment is unsafe.",
    "wrongAnswerNotes": {
      "Continue therapy and recheck echo in 6 months": "Delays necessary evaluation.",
      "Start high-dose steroids for pneumonitis": "Cardiac, not pulmonary toxicity, is suspected.",
      "Discontinue all systemic therapy permanently": "Hold and evaluate first; many recover with interruption."
    },
    "domain": "Nursing Practice",
    "tags": [
      "trastuzumab",
      "cardiotoxicity",
      "LVEF"
    ]
  },
  {
    "id": "L2Q037",
    "stem": "Two weeks after ALND, a patient reports tight, painful cord-like structures along the medial upper arm limiting abduction. What is the BEST first-line intervention?",
    "choices": [
      "Early physical therapy with gentle range-of-motion and cording-specific techniques",
      "Prolonged sling immobilization to rest the arm",
      "Empiric antibiotics for presumed cellulitis",
      "High-intensity resistance training to break cords"
    ],
    "answerIndex": 0,
    "rationale": "Axillary web syndrome (cording) responds to PT and gentle ROM; immobilization and high-intensity exercise are inappropriate; antibiotics are not indicated absent infection.",
    "wrongAnswerNotes": {
      "Prolonged sling immobilization to rest the arm": "Increases stiffness and delays recovery.",
      "Empiric antibiotics for presumed cellulitis": "No infection signs.",
      "High-intensity resistance training to break cords": "Too aggressive."
    },
    "domain": "Nursing Practice",
    "tags": [
      "axillary web syndrome",
      "rehabilitation",
      "range of motion"
    ]
  },
  {
    "id": "L2Q038",
    "stem": "A 33-year-old on AC chemotherapy asks about scalp cooling. Which statement is MOST accurate counseling?",
    "choices": [
      "Scalp cooling can reduce but not eliminate alopecia; effectiveness varies by regimen and center protocol",
      "Scalp cooling completely prevents alopecia in all patients",
      "Minoxidil use during chemotherapy prevents hair loss",
      "Shaving the head prevents alopecia"
    ],
    "answerIndex": 0,
    "rationale": "Scalp cooling reduces incidence/severity but is not guaranteed; minoxidil assists regrowth; shaving does not prevent follicle injury.",
    "wrongAnswerNotes": {
      "Scalp cooling completely prevents alopecia in all patients": "Overpromise; not accurate.",
      "Minoxidil use during chemotherapy prevents hair loss": "Not preventive.",
      "Shaving the head prevents alopecia": "Does not prevent hair loss."
    },
    "domain": "Nursing Practice",
    "tags": [
      "alopecia",
      "scalp cooling",
      "patient education"
    ]
  },
  {
    "id": "L2Q039",
    "stem": "A patient receiving capecitabine reports painful erythema and peeling of palms/soles (HFS). What is the BEST initial management?",
    "choices": [
      "Hold capecitabine, implement urea-based emollients and supportive care; resume at reduced dose when improved",
      "Continue full dose and add systemic corticosteroids",
      "Switch immediately to doxorubicin",
      "Stop all chemotherapy permanently"
    ],
    "answerIndex": 0,
    "rationale": "Hand–foot syndrome is managed with dose hold/reduction and supportive care. Steroids and switching to anthracycline are not first-line.",
    "wrongAnswerNotes": {
      "Continue full dose and add systemic corticosteroids": "Does not address causative dose exposure.",
      "Switch immediately to doxorubicin": "Unrelated agent and toxicity profile.",
      "Stop all chemotherapy permanently": "Too aggressive before attempting dose adjustment."
    },
    "domain": "Nursing Practice",
    "tags": [
      "capecitabine",
      "hand-foot syndrome",
      "dose modification"
    ]
  },
  {
    "id": "L2Q040",
    "stem": "During whole-breast irradiation, a patient develops moist desquamation in the inframammary fold. What is the BEST nursing intervention?",
    "choices": [
      "Gentle cleansing, moisture-control dressings, minimize friction/heat, and notify radiation team",
      "Daily vigorous exfoliation to remove dead skin",
      "Ice packs directly on the area for comfort",
      "Topical prophylactic antibiotics to all irradiated skin"
    ],
    "answerIndex": 0,
    "rationale": "Standard care includes gentle cleansing, moisture balance, and friction reduction; exfoliation and ice are harmful; antibiotics are not prophylactic.",
    "wrongAnswerNotes": {
      "Daily vigorous exfoliation to remove dead skin": "Increases injury.",
      "Ice packs directly on the area for comfort": "May further damage skin.",
      "Topical prophylactic antibiotics to all irradiated skin": "Reserve for infection."
    },
    "domain": "Nursing Practice",
    "tags": [
      "radiation dermatitis",
      "skin care",
      "supportive care"
    ]
  },
  {
    "id": "L2Q041",
    "stem": "A 51-year-old with anxiety on paroxetine starts tamoxifen. What is the MOST accurate counseling?",
    "choices": [
      "Paroxetine inhibits CYP2D6 and may reduce tamoxifen efficacy; discuss alternative agents (e.g., venlafaxine)",
      "Paroxetine is preferred because it reduces hot flashes on tamoxifen",
      "No interaction exists and no changes are needed",
      "Stop all antidepressants while on tamoxifen"
    ],
    "answerIndex": 0,
    "rationale": "Strong CYP2D6 inhibitors (paroxetine) can lower endoxifen levels; alternative non-strong inhibitors are preferred.",
    "wrongAnswerNotes": {
      "Paroxetine is preferred because it reduces hot flashes on tamoxifen": "Although it helps vasomotor symptoms, interaction is problematic.",
      "No interaction exists and no changes are needed": "Incorrect.",
      "Stop all antidepressants while on tamoxifen": "Not necessary; switch to alternatives."
    },
    "domain": "Nursing Practice",
    "tags": [
      "tamoxifen",
      "CYP2D6",
      "drug interactions",
      "hot flashes"
    ]
  },
  {
    "id": "L2Q042",
    "stem": "A postoperative mastectomy patient with immediate tissue expander reports progressive dusky skin flaps that are cool to touch. What is the nurse’s PRIORITY action?",
    "choices": [
      "Urgent surgical evaluation for possible ischemia/necrosis",
      "Apply warm packs and reassess in 24 hours",
      "Reassure that bruising is expected",
      "Increase drain stripping frequency"
    ],
    "answerIndex": 0,
    "rationale": "Findings suggest compromised perfusion requiring urgent surgical assessment. Delay risks necrosis and implant loss.",
    "wrongAnswerNotes": {
      "Apply warm packs and reassess in 24 hours": "Delays needed evaluation.",
      "Reassure that bruising is expected": "Not consistent with dusky, cool flaps.",
      "Increase drain stripping frequency": "Unrelated to ischemia."
    },
    "domain": "Nursing Practice",
    "tags": [
      "postoperative",
      "reconstruction",
      "ischemia",
      "urgent evaluation"
    ]
  },
  {
    "id": "L2Q043",
    "stem": "A patient on doxorubicin asks which test monitors heart function during therapy. What is the BEST response?",
    "choices": [
      "Echocardiogram or MUGA scan assesses left ventricular ejection fraction",
      "Bone density scan assesses risk of heart failure",
      "PET/CT monitors cardiotoxicity",
      "Electrolyte panel alone detects early cardiomyopathy"
    ],
    "answerIndex": 0,
    "rationale": "Anthracyclines require baseline and periodic assessment of LVEF via echo or MUGA.",
    "wrongAnswerNotes": {
      "Bone density scan assesses risk of heart failure": "Unrelated test.",
      "PET/CT monitors cardiotoxicity": "Not a standard modality for this purpose.",
      "Electrolyte panel alone detects early cardiomyopathy": "Insufficient."
    },
    "domain": "Nursing Practice",
    "tags": [
      "anthracycline",
      "cardiotoxicity",
      "LVEF",
      "surveillance"
    ]
  },
  {
    "id": "L2Q044",
    "stem": "A 62-year-old on an AI reports severe arthralgias limiting activity. What is the MOST appropriate nursing intervention to support adherence?",
    "choices": [
      "Encourage exercise/physical therapy, consider analgesic strategies, and notify provider to consider switching AIs",
      "Advise immediate discontinuation of endocrine therapy",
      "Recommend chronic systemic steroids",
      "Switch to tamoxifen without discussing alternatives"
    ],
    "answerIndex": 0,
    "rationale": "AI arthralgia can be mitigated by exercise/PT, analgesia, and sometimes switching within the AI class; uninterrupted therapy is important.",
    "wrongAnswerNotes": {
      "Advise immediate discontinuation of endocrine therapy": "Undermines outcomes without attempting management.",
      "Recommend chronic systemic steroids": "Not appropriate long-term.",
      "Switch to tamoxifen without discussing alternatives": "Switching within class may help; shared decision-making first."
    },
    "domain": "Nursing Practice",
    "tags": [
      "aromatase inhibitor",
      "arthralgia",
      "adherence",
      "supportive care"
    ]
  },
  {
    "id": "L2Q045",
    "stem": "A patient after SLNB develops mild shoulder stiffness. Which is the BEST early advice?",
    "choices": [
      "Gentle range-of-motion exercises and gradual return to activity",
      "Prolonged immobilization in a sling",
      "High-intensity upper-body strength training immediately",
      "Avoid moving the shoulder for 6 weeks"
    ],
    "answerIndex": 0,
    "rationale": "Early gentle ROM prevents frozen shoulder and supports function; immobilization is counterproductive.",
    "wrongAnswerNotes": {
      "Prolonged immobilization in a sling": "Increases stiffness risk.",
      "High-intensity upper-body strength training immediately": "Advance gradually.",
      "Avoid moving the shoulder for 6 weeks": "Excessive restriction."
    },
    "domain": "Nursing Practice",
    "tags": [
      "SLNB",
      "rehabilitation",
      "range of motion"
    ]
  },
  {
    "id": "L2Q046",
    "stem": "A patient on olaparib for gBRCA1 metastatic TNBC reports fatigue and anemia. What is the BEST nursing action?",
    "choices": [
      "Obtain CBC, assess for symptomatic anemia, and notify provider for dose modification guidance",
      "Stop therapy permanently without evaluation",
      "Start high-dose erythropoietin immediately",
      "Switch to immunotherapy without labs"
    ],
    "answerIndex": 0,
    "rationale": "PARP inhibitors can cause anemia; appropriate evaluation and dose adjustment are indicated; ESAs are not started without assessment.",
    "wrongAnswerNotes": {
      "Stop therapy permanently without evaluation": "Too extreme; evaluate first.",
      "Start high-dose erythropoietin immediately": "Not first-line without criteria and evaluation.",
      "Switch to immunotherapy without labs": "Premature; confirm cause and manage per label."
    },
    "domain": "Nursing Practice",
    "tags": [
      "PARP inhibitor",
      "olaparib",
      "anemia",
      "CBC",
      "dose modification"
    ]
  },
  {
    "id": "L2Q047",
    "stem": "A 37-year-old scheduled for bilateral mastectomy is tearful about changes to her body and sexuality. What is the BEST nursing intervention?",
    "choices": [
      "Offer referral to counseling/sex therapy and peer support; provide validated educational resources",
      "Reassure that most patients adjust quickly without support",
      "Delay surgery until she no longer feels distressed",
      "Focus education only on drain care and wound management"
    ],
    "answerIndex": 0,
    "rationale": "Addressing body image and sexual health concerns with counseling and peer support improves coping; education should include psychosocial aspects.",
    "wrongAnswerNotes": {
      "Reassure that most patients adjust quickly without support": "Minimizes concerns; not patient-centered.",
      "Delay surgery until she no longer feels distressed": "Not necessary if support is offered and informed consent intact.",
      "Focus education only on drain care and wound management": "Psychosocial care is also essential."
    },
    "domain": "Psychosocial Dimensions of Care",
    "tags": [
      "body image",
      "sexual health",
      "counseling",
      "peer support"
    ]
  },
  {
    "id": "L2Q048",
    "stem": "A recently divorced 50-year-old starting adjuvant chemotherapy expresses financial stress and food insecurity. What is the nurse’s BEST action?",
    "choices": [
      "Initiate referrals to social work and financial navigation; connect to local/community resources",
      "Encourage her to focus on treatment and address finances later",
      "Provide a generic online list of charities without assessing eligibility",
      "Suggest postponing chemotherapy until finances improve"
    ],
    "answerIndex": 0,
    "rationale": "Financial toxicity is common; timely social work/financial navigation and concrete community resources mitigate barriers and improve adherence.",
    "wrongAnswerNotes": {
      "Encourage her to focus on treatment and address finances later": "Minimizes a key barrier to adherence.",
      "Provide a generic online list of charities without assessing eligibility": "Less effective than targeted navigation.",
      "Suggest postponing chemotherapy until finances improve": "Treatment delays worsen outcomes."
    },
    "domain": "Psychosocial Dimensions of Care",
    "tags": [
      "financial toxicity",
      "navigation",
      "resources",
      "adherence"
    ]
  },
  {
    "id": "L2Q049",
    "stem": "A 63-year-old widower with metastatic disease expresses hopelessness and passive thoughts of 'not waking up.' What is the MOST appropriate nursing response?",
    "choices": [
      "Conduct suicide risk screening and notify the provider; engage psychosocial and palliative support",
      "Reassure him that these feelings are normal and will pass",
      "Increase opioid dose to help him sleep through distress",
      "Delay action until the next clinic visit"
    ],
    "answerIndex": 0,
    "rationale": "Expressions suggesting self-harm risk require immediate assessment and team notification; palliative and psychosocial services should be engaged.",
    "wrongAnswerNotes": {
      "Reassure him that these feelings are normal and will pass": "Invalidates and risks safety.",
      "Increase opioid dose to help him sleep through distress": "Unsafe and not addressing root cause.",
      "Delay action until the next clinic visit": "Delay is unsafe."
    },
    "domain": "Psychosocial Dimensions of Care",
    "tags": [
      "suicide risk",
      "distress screening",
      "palliative care",
      "psychosocial"
    ]
  },
  {
    "id": "L2Q050",
    "stem": "A 46-year-old single mother receiving neoadjuvant therapy reports severe fatigue, struggles with childcare, and missed two infusions. What is the nurse’s BEST next step?",
    "choices": [
      "Coordinate supportive services (social work, transportation, childcare resources) and fatigue management education",
      "Advise caffeine and rest when possible",
      "Document non-adherence in the chart and proceed",
      "Reduce chemotherapy dose without addressing barriers"
    ],
    "answerIndex": 0,
    "rationale": "Address social barriers and provide symptom management to improve adherence; simple advice or punitive documentation does not resolve access issues.",
    "wrongAnswerNotes": {
      "Advise caffeine and rest when possible": "Insufficient plan.",
      "Document non-adherence in the chart and proceed": "Does not address barriers.",
      "Reduce chemotherapy dose without addressing barriers": "Undercuts efficacy without solving root problems."
    },
    "domain": "Psychosocial Dimensions of Care",
    "tags": [
      "fatigue",
      "navigation",
      "adherence",
      "supportive care",
      "social determinants"
    ]
  }
]